; domain
(define (domain emergency-services-transporters)
  (:requirements :strips :typing)

  (:types
    location person drone crate content transporter num
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (at-transporter ?t - transporter ?l - location)
    (hand-empty ?d - drone)
    (holding ?d - drone ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
    (in-transporter ?c - crate ?t - transporter)
    (free-slots ?t - transporter ?n - num)
    (siguiente ?n1 - num ?n2 - num)
  )

  (:action fly
  :parameters (?d - drone ?from - location ?to - location)
  :precondition (at-drone ?d ?from)
  :effect (and
    (not (at-drone ?d ?from))
    (at-drone ?d ?to)
  )
)

  (:action pick-up
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (hand-empty ?d)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (hand-empty ?d))
      (holding ?d ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?d ?c)
      (crate-content ?c ?cnt)
    )
    :effect (and
      (not (holding ?d ?c))
      (hand-empty ?d)
      (has-content ?p ?cnt)
    )
  )

  (:action put-in-transporter
    :parameters (?d - drone ?c - crate ?t - transporter ?l - location ?n-new - num ?n-old - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?t ?l)
      (holding ?d ?c)
      (free-slots ?t ?n-old)
      (siguiente ?n-new ?n-old)
    )
    :effect (and
      (not (holding ?d ?c))
      (hand-empty ?d)
      (in-transporter ?c ?t)
      (not (free-slots ?t ?n-old))
      (free-slots ?t ?n-new)
    )
  )

  (:action move-transporter
    :parameters (?d - drone ?t - transporter ?from - location ?to - location)
    :precondition (and
      (at-drone ?d ?from)
      (at-transporter ?t ?from)
      (hand-empty ?d)
    )
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (not (at-transporter ?t ?from))
      (at-transporter ?t ?to)
    )
  )

  (:action take-out-transporter
    :parameters (?d - drone ?c - crate ?t - transporter ?l - location ?n-old - num ?n-new - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?t ?l)
      (in-transporter ?c ?t)
      (hand-empty ?d)
      (free-slots ?t ?n-old)
      (siguiente ?n-old ?n-new)
    )
    :effect (and
      (not (in-transporter ?c ?t))
      (not (hand-empty ?d))
      (holding ?d ?c)
      (not (free-slots ?t ?n-old))
      (free-slots ?t ?n-new)
    )
  )
)

; problem
(define (problem problem_d1_r1_l6_p6_c6_g6)
  (:domain emergency-services-transporters)
  (:objects
    drone1 - drone
    transporter1 - transporter

    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location

    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person

    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate

    food - content
    medicine - content

    n0 n1 n2 n3 n4 - num
  )

  (:init
    (at-drone drone1 depot)
    (at-transporter transporter1 depot)
    (hand-empty drone1)

    (free-slots transporter1 n4)
    (siguiente n0 n1)
    (siguiente n1 n2)
    (siguiente n2 n3)
    (siguiente n3 n4)

    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)

    (at-person person1 loc1)
    (at-person person2 loc4)
    (at-person person3 loc6)
    (at-person person4 loc1)
    (at-person person5 loc6)
    (at-person person6 loc3)

    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 medicine)
  )

  (:goal
    (and
      (has-content person1 food)
      (has-content person2 food)
      (has-content person3 food)
      (has-content person4 medicine)
      (has-content person5 food)
      (has-content person6 food)
    )
  )
)

; plan
1. (pick-up drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1)
   added: (holding drone1 crate2)
   goals met: 0 of 6
2. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 0 of 6
3. (deliver drone1 crate2 person2 loc4 food)
   deleted: (holding drone1 crate2)
   added: (hand-empty drone1) (has-content person2 food)
   goals met: 1 of 6
4. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 1 of 6
5. (pick-up drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1)
   added: (holding drone1 crate4)
   goals met: 1 of 6
6. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 1 of 6
7. (deliver drone1 crate4 person5 loc6 food)
   deleted: (holding drone1 crate4)
   added: (hand-empty drone1) (has-content person5 food)
   goals met: 2 of 6
8. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 2 of 6
9. (pick-up drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1)
   added: (holding drone1 crate6)
   goals met: 2 of 6
10. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 2 of 6
11. (deliver drone1 crate6 person4 loc1 medicine)
   deleted: (holding drone1 crate6)
   added: (hand-empty drone1) (has-content person4 medicine)
   goals met: 3 of 6
12. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 6
13. (pick-up drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1)
   added: (holding drone1 crate5)
   goals met: 3 of 6
14. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 3 of 6
15. (deliver drone1 crate5 person3 loc6 food)
   deleted: (holding drone1 crate5)
   added: (hand-empty drone1) (has-content person3 food)
   goals met: 4 of 6
16. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 4 of 6
17. (pick-up drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1)
   added: (holding drone1 crate3)
   goals met: 4 of 6
18. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 4 of 6
19. (deliver drone1 crate3 person6 loc3 food)
   deleted: (holding drone1 crate3)
   added: (hand-empty drone1) (has-content person6 food)
   goals met: 5 of 6
20. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 5 of 6
21. (pick-up drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1)
   added: (holding drone1 crate1)
   goals met: 5 of 6
22. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 5 of 6
23. (deliver drone1 crate1 person1 loc1 food)
   deleted: (holding drone1 crate1)
   added: (hand-empty drone1) (has-content person1 food)
   goals met: 6 of 6
